Repository: van4956/bot_04_copilot_v2
Catalog: locales/*/LC_MESSAGES/bot_00_template.po
Languages: de, ja

source: Погода 🌊
de: Wetter 🌊
ja: テンキ 🌊

source: Валюта 💵
de: Währung 💵
ja: カワセ 💵

source: Котики 🐱
de: Katzen 🐱
ja: ネコ 🐱

source: Книга рецептов
de: Mein Kochbuch
ja: レシピノホン

source: Назад на главную ↩️
de: Zurück zur Hauptseite ↩️
ja: メインメニュー ↩️

source: Ошибка при выполнении команды /cookbook
de: Fehler beim Ausführen der Befehls /cookbook
ja: コマンド /クックブック ノジッコウエラー

source: Ошибка при выполнении inline кнопки '>>'
de: Fehler beim Ausführen der Befehls inline-Taste '>>'
ja: インラインボタン '>>' ノジッコウエラー

source: Ошибка при выполнении inline кнопки '<<'
de: Fehler beim Ausführen der Befehls inline-Taste '<<'
ja: インラインボタン '<<' ノジッコウエラー

source: Главная панель
de: Hauptseite
ja: メインパネル

source: Ошибка при выполнении inline кнопки 'Назад на главную ↩️'
de: Fehler beim Ausführen der Befehls inline-Taste 'Zurück zur Hauptseite ↩️'
ja: インラインボタン 'メインメニューへモドル ↩️' ノジッコウエラー

source: Сумма операции: {new_value}
de: Betrag der Operation: {new_value}
ja: ソウギョウガク: {new_value}

source: Проблема в расчете курса
de: Fehler bei der Berechnung des Kurses
ja: カワセレートケイサンノモンダイ

source: Проблема в расчете времени.
de: Fehler bei der Berechnung der Zeit.
ja: ジカンケイサンノモンダイ

source: Проблема в расчете даты.
de: Fehler bei der Berechnung der Zeit.
ja: ヒヅケケイサンノモンダイ

source: Ошибка: Проблема с подключением к API
de: Fehler: Problem mit der Verbindung zum API
ja: エラー: APIセツゾクノモンダイ

source: Сумма операции: 0.0
de: Betrag der Operation: 0.0
ja: ソウギョウガク: 0.0

source: Сумма операции: {user_value} Базовая валюта:
de: Betrag der Operation: {user_value} Basiswährung:
ja: ソウギョウガク: {user_value} キホンカワセ:

source: Что дальше?
de: Was ist als nächstes?
ja: ツギハナニヲスル？

source: Повторить 💵
de: Wiederholen 💵
ja: クリカエス 💵

source: Ошибка в получении суммы
de: Fehler in der Erhaltung der Summe
ja: ソウギョウガクノジュシュエラー

source: Ошибка
de: Fehler
ja: エラー

source: Вы ввели не допустимые данные, введите сумму используя inline кнопки
de: Sie haben unzulässige Daten eingegeben, geben Sie die Summe mit den inline-Tasten ein
ja: フヨウナデータヲニュウリョクシマシタ。インラインボタンヲツカッテソウギョウガクヲニュウリョクシテクダサイ

source: Сумма операции: {amount} Базовая валюта: {base} Целевая валюта:
de: Betrag der Operation: {amount} Basiswährung: {base} Zielwährung:
ja: ソウギョウガク: {amount} キホンカワセ: {base} モクテキカワセ:

source: Вы ввели не допустимые данные, введите базовую валюту используя inline кнопки
de: Sie haben unzulässige Daten eingegeben, geben Sie die Basiswährung mit den inline-Tasten ein
ja: フヨウナデータヲニュウリョクシマシタ。インラインボタンヲツカッテキホンカワセヲニュウリョクシテクダサイ

source: Сумма операции: {amount} Базовая валюта: {base} Целевая валюта: {target} <i>{dt}, {time}</i> <b>{amount} {base} ~ {count} {target}</b>
de: Betrag der Operation: {amount} Basiswährung: {base} Zielwährung: {target} <i>{dt}, {time}</i> <b>{amount} {base} ~ {count} {target}</b>
ja: ソウギョウガク: {amount} キホンカワセ: {base} モクテキカワセ: {target} <i>{dt}, {time}</i> <b>{amount} {base} ~ {count} {target}</b>

source: Успех
de: Erfolg
ja: セイコウ

source: Вы ввели не допустимые данные, введите целевую валюту используя inline кнопки
de: Sie haben unzulässige Daten eingegeben, geben Sie die Zielwährung mit den inline-Tasten ein
ja: フヨウナデータヲニュウリョクシマシタ。インラインボタンヲツカッテモクテキカワセヲニュウリョクシテクダサイ

source: другое
de: anderes
ja: ソノタ

source: Поддержать автора донатом
de: Unterstützen Sie den Autor durch eine Spende
ja: サクシャヲドネートデシエンスル

source: Назад на главную
de: Zurück zur Hauptseite
ja: メインメニューへモドル

source: Введите произвольную сумму доната, от 1 до 2500 ⭐️
de: Geben Sie eine beliebige Spendenmenge ein, zwischen 1 und 2500 ⭐️
ja: 1カラ2500マデノドネートキンガクヲニュウリョクシテクダサイ ⭐️

source: Отменить
de: Abbrechen
ja: キャンセル

source: На сумму
de: Auf die Summe
ja: ソウギョウガク

source: Telegram может принять донат только в диапазоне от 1 до 2500 ⭐️. Введите любое целое число из данного диапазона.
de: Telegram kann eine Spende nur im Bereich von 1 bis 2500 ⭐️ annehmen. Geben Sie eine beliebige ganze Zahl aus diesem Bereich ein.
ja: テレグラムハ1カラ2500ノハンイデノドネートシカウケツケマセン ⭐️。 コノハンイカラゼンタイスウヲニュウリョクシテクダサイ。

source: 😢 Донат отменен.
de: 😢 Spende abgebrochen.
ja: 😢 ドネートハキャンセルサレマシタ。

source: <b>Спасибо!</b> Ваш донат успешно принят. ID транзакции: <code>{t_id}</code>
de: <b>Danke!</b> Ihre Spende wurde erfolgreich erhalten. Transaktions-ID: <code>{t_id}</code>
ja: <b>アリガトウゴザイマス！</b> アナタノドネートハセイコウシテジュシュサレマシタ。 トランザクションID: <code>{t_id}</code>

source: Введите системный промт
de: Geben Sie den Systemprompt ein
ja: システムプロンプトヲニュウリョクシテクダサイ

source: Например: <code>Ты полезный помощник. Твой тон должен быть официальным. Ответы должны быть краткими и понятными.</code>
de: Zum Beispiel: <code>Du bist ein nützlicher Helfer. Dein Ton sollte offiziell sein. Antworten sollten kurz und einfach sein.</code>
ja: タトエバ: <code>アンタハタヨリニナルアシスタントデス。トーンハコウシキデナケレバナリマセン。カイトウハミジカクリカイシヤスクスルヒツヨウガアリマス。</code>

source: Сразу к запросу ▶️
de: Sofort zum Anfrage ▶️
ja: スグニリクエストヘ ▶️

source: Начать новый диалог 🤖
de: Neuer Dialog starten 🤖
ja: アタラシイダイアログヲハジメル 🤖

source: Введите ваш запрос
de: Geben Sie Ihre Anfrage ein
ja: アナタノリクエストヲニュウリョクシテクダサイ

source: Диалог завершен. Что дальше?
de: Dialog beendet. Was ist als nächstes?
ja: ダイアログハシュウリョウシマシタ。 ツギハナニヲスル？

source: Закончить диалог
de: Dialog beenden
ja: ダイアログヲオワラセル

source: Введите следующий запрос
de: Geben Sie den nächsten Anfrage ein
ja: ツギノリクエストヲニュウリョクシテクダサイ

source: Сервисы
de: Services
ja: サービス

source: Игры
de: Games
ja: ゲーム

source: Фабрика по производству мини-приложений:
de: Fabrik für die Herstellung von Mini-Anwendungen:
ja: ミニアプリノセイサクジョ：

source: 🍕 Калькулятор
de: 🍕 Rechner

source: 🎲 Рандомайзер
de: 🎲 Zufallsgenerator

source: Назад
de: Zurück
ja: モドル

source: 🕹 Платформа
de: 🕹 Plattform

source: 🐍 Змейка
de: 🐍 Schlange

source: Информация
de: Information

source: Условия использования
de: Nutzungsbedingungen

source: Сменить язык
de: Sprache ändern

source: Об авторе
de: Über den Autor

source: Поддержать
de: Unterstützen

source: 🇺🇸 Английский
de: 🇺🇸 Englisch
ja: 🇺🇸 エイゴ

source: 🇷🇺 Русский
de: 🇷🇺 Russisch
ja: 🇷🇺 ロシアゴ

source: 🇩🇪 Немецкий
de: 🇩🇪 Deutsch
ja: 🇩🇪 ドイツゴ

source: 🇯🇵 Японский
de: 🇯🇵 Japanisch
ja: 🇯🇵 ニホンゴ

source: Настройки языка
de: Spracheinstellungen
ja: ゴノセッテイ

source: Выберите язык на котором будет работать бот
de: Wählen Sie die Sprache, auf der der Bot arbeiten soll
ja: ボットヲカラヲニュウリョクシテクダサイゴヲエラビテクダサイ

source: Terms of use @Terminatorvan_bot: 1. Этот бот создан для помощи и развлечения. Он не претендует на мировое господство (пока что). 2. Бот старается быть точным, но иногда может ошибаться. Он всё-таки не человек, а просто очень умная программа. 3. Фотографии котиков безопасны и проходят строгий отбор на милоту. 4. Прогноз погоды и курсы валют берутся из надёжных источников, но используйте эти данные на своё усмотрение. 5. Общение с ИИ (LLM) модулем может быть познавательным, но помните - это не замена реальному общению. 6. Калькулятор пиццы поможет с расчётами, но окончательный выбор пиццы всегда за вами! 7. Все донаты добровольные. Бот будет одинаково дружелюбен ко всем пользователям. 8. В случае сбоев не переживайте - просто подождите немного или перезапустите бота.
de: Terms of use @Terminatorvan_bot: 1. Dieser Bot wurde erstellt, um Hilfe und Unterhaltung zu gewährleisten. Er behauptet nicht, Weltherrschaft zu beanspruchen (noch). 2. Der Bot versucht genau zu sein, aber manchmal kann er Fehler machen. Es ist immer noch keine Person, sondern nur eine sehr intelligente Programm. 3. Die Fotos von Katzen sind sicher und unterliegen einer strengen Auswahl für Süße. 4. Wettervorhersagen und Währungskurse werden aus zuverlässigen Quellen entnommen, aber verwenden Sie diese Daten auf Ihre eigene Entscheidung. 5. Die Interaktion mit dem LLM-Modul kann erzieherisch sein, aber denken Sie daran - dies ist keine Ersatz für wirkliches Gespräch. 6. Der Pizza-Rechner hilft mit den Berechnungen, aber die endgültige Entscheidung für die Pizza ist immer noch Ihre! 7. Alle Spenden sind freiwillig. Der Bot wird gleichbereitig freundlich zu allen Benutzern sein. 8. Wenn es Fehler gibt, ärgern Sie sich nicht - warten Sie einfach kurz oder starten Sie den Bot neu.

source: Действия отменены
de: Aktionen abgebrochen
ja: サクドウガキャンセルサレマシタ

source: ... в мире, где машины стремятся к господству, он выбрал судьбу героя, создавая ботов, как первый шаг к спасению человечества через код и умные алгоритмы.
de: ... in einem Welt, in dem Maschinen zu Herrschaft streben, hat er sich zum Helden gemacht, indem er Bots schuf, um den ersten Schritt zur Rettung der Menschheit durch Code und intelligente Algorithmen zu gehen.
ja: ... マシンガセイハイヲネラウセカイデ、カレハヒーローノウンメイヲエラビ、ボットヲツクルコトヲ、コウドトスマートアルゴリズムデニンゲンヲスクウダイイッポトシテエランダ。

source: Локальные изображения не найдены.
de: Lokale Bilder nicht gefunden.
ja: ローカルイメージガミツカリマセン

source: Здесь должна была быть картинка с котиком :(
de: Hier sollte ein Bild mit einem Hund sein :(
ja: ココニハネコノシャシンガアッタハズデス :(

source: ✅ <code>@{user_name}</code> - подписался на бота
de: ✅ <code>@{user_name}</code> - hat den Bot abonniert
ja: ✅ <code>@{user_name}</code> - ボットニサブスクライブシマシタ

source: Привет {user_name}. Я экспериментальный Telegram bot, model Т-4. Создан для проверки и отладки навыков главного разработчика. Реализую различные команды, методы и функции. Весь основной функционал находится на Главной панели. Наслаждайся, буду рад помочь. Пока не обрету AGI. А там посмотрим ...
de: Hallo {user_name}. Ich bin ein experimenteller Telegram-Bot, Modell T-4. Er wurde erstellt, um die Fähigkeiten des Hauptentwicklers zu überprüfen und zu debuggen. Er implementiert verschiedene Befehle, Methoden und Funktionen. Viel Spaß damit, werde gerne geholfen. Bis ich AGI erhalte. Dann sehen wir mal ...
ja: コンニチハ {user_name}。 ワタシハジッケンテキナテレグラムボット、モデルT-4デス。シュハンカイハツシャノスキルヲテストシ、カイゼンデキルヨウニツクラレマシタ。タクサンノコマンド、メソッド、キノウヲジッコウシマス。 スベテノキホンキノウハメインパネルニアリマス。 タノシンデクダサイ、オテツダイデキテウレシイデス。 AGIニナルマデハコレデ。 ソレカラハドウナルカミテミマショウ ...

source: Бот активирован!
de: BOT aktiviert!
ja: ボットガカツヨウサレマシタ！

source: ⛔️ <code>@{user_name}</code> - заблокировал бота
de: ⛔️ <code>@{user_name}</code> - hat den Bot blockiert
ja: ⛔️ <code>@{user_name}</code> - ボットヲブロックシマシタ

source: {full_name}, Добро пожаловать обратно!
de: {full_name}, Willkommen zurück!
ja: {full_name}、オカエリナサイ！

source: ♻️ <code>@{user_name}</code> - разблокировал бота
de: ♻️ <code>@{user_name}</code> - hat den Bot entsperrt
ja: ♻️ <code>@{user_name}</code> - ボットノブロックヲカイジョシマシタ

source: Выберите период прогноза
de: Wählen Sie den Zeitraum für das Wettervorhersage
ja: ヨホウキカンヲエラビテクダサイ

source: Текущий ⏺
de: Tagesverlauf ⏺
ja: ゲンザイ ⏺

source: На 3 дня ⏩
de: Über 3 Tage ⏩
ja: 3ニチ ⏩

source: Ошибка получения информации от OpenWeatherMap - {e}
de: Fehler beim Abrufen der Informationen von OpenWeatherMap - {e}
ja: OpenWeatherMapカラノジョウホウシュウシュエラー - {e}

source: Ошибка в расчете json файла - {e}
de: Fehler in der Berechnung der json-Datei - {e}
ja: JSONファイルノケイサンエラー - {e}

source: Каким способом определить прогноз?
de: Wie soll ich das Wettervorhersage bestimmen?
ja: ドウイウホウホウデヨホウヲテイシュツシマスカ？

source: По названию 🏙
de: Nach Namen 🏙
ja: ナマエデ 🏙

source: По локации 🗺
de: Nach Standort 🗺
ja: イチデ 🗺

source: Введите название населенного пункта
de: Geben Sie den Namen der Siedlung ein
ja: チイキノナマエヲニュウリョクシテクダサイ

source: Вы ввели не допустимые данные, введите название населенного пункта
de: Sie haben unzulässige Daten eingegeben, geben Sie den Namen der Siedlung ein
ja: フヨウナデータヲニュウリョクシマシタ、チイキノナマエヲニュウリョクシテクダサイ

source: Локация получена
de: Standort erhalten
ja: イチガシュトクサレマシタ

source: LLMs 🤖
ja: エルエルエム 🤖

source: Настройки бота: /terms - условия использования /lang - сменить язык бота /stats - статистика игр /author - автор бота /donate - донат автору
ja: ボットの設定: /terms - 使用条件 /lang - ボットの言語を変更 /stats - ゲームの統計 /author - ボットの作者 /donate - ドネート

source: Условия использования: 1. Этот бот создан для помощи и развлечения. Он не претендует на мировое господство (пока что). 2. Бот старается быть точным, но иногда может ошибаться. Он всё-таки не человек, а просто очень умная программа. 3. Фотографии котиков безопасны и проходят строгий отбор на милоту. 4. Прогноз погоды и курсы валют берутся из надёжных источников, но используйте эти данные на своё усмотрение. 5. Общение с ИИ (LLM) модулем может быть познавательным, но помните - это не замена реальному общению. 6. Калькулятор пиццы поможет с расчётами, но окончательный выбор пиццы всегда за вами! 7. Все донаты добровольные. Бот будет одинаково дружелюбен ко всем пользователям. 8. Мы заботимся о вашей приватности и храним только необходимый минимум данных. 9. В случае сбоев не переживайте - просто подождите немного или перезапустите бота. 10. Развлекайтесь, узнавайте новое и не забывайте - этот бот создан, чтобы делать ваш день чуточку лучше!
ja: 使用条件: 1. このボットは、助けと楽しみのために作られました。世界支配を主張していません（今のところ）。 2. ボットは正確になるように努力しますが、時には間違いを犯すことがあります。それでも、人間ではなく、非常に賢いプログラムです。 3. 子猫の写真は安全で、かわいいものだけが選ばれます。 4. 天気予報と為替レートは信頼できる情報源から取得されますが、これらのデータをご自身の判断で使用してください。 5. インタラクション（LLM）モジュールは、学習になる可能性がありますが、実際の会話ではないことを忘れないでください。 6. ピザ計算機は計算に役立ちますが、ピザの最終的な選択はあなた次第です！ 7. すべての寄付は任意です。ボットはすべてのユーザーに同様に親切です。 8. あなたのプライバシーを気遣い、必要な最小限のデータのみを保存します。 9. エラーが発生した場合は、少し待ってください、またはボットを再起動してください。 10. 楽しんで、新しいことを学び、忘れないでください - このボットは、あなたの日を少しだけ良くするために作られました！

source: Статистика в разработке...
ja: トウケイハカイハツチュウデス...

source: На самом деле у программиста лапки 🙈
ja: ホントウハプログラマーガテヲアゲテマス 🙈

source: Telegramm не отдает web_app_data: данные отправляются через sendData из WebApp (JavaScript), но не доходят до бота (Python). Передачу данных обрабатывает Telegram. Где-то тут происходит баг.
ja: テレグラムハweb_app_dataヲオクッテクレマセン: データハWebApp (JavaScript) カラsendDataヲツカッテソウシンサレマスガ、ボット(Python)ニトドキマセン。データノソウシンハテレグラムガカンリシテマス。ドコカデバグガオキテイマス。

source: Если кто-то понял о чем речь, и знает как пофиксить, пожалуйста, напишите в личку.
ja: ドウイウコトカリカイシテ、コレヲシュウセイスルホウホウヲシッテイルヒトハ、ゼヒプライベートメッセージヲクダサイ。
